Revit 2027 API
ViewSchedule.CreateKeynoteLegend Method
 Creates a keynote legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewSchedule CreateKeynoteLegend(
	Document document
)
Public Shared Function CreateKeynoteLegend (
	document As Document
) As ViewSchedule
public:
static ViewSchedule^ CreateKeynoteLegend(
	Document^ document
)
static member CreateKeynoteLegend :
        document : Document -> ViewSchedule
Parameters
document Document
 The document to which the new schedule will be added.
Return Value
ViewSchedule
 The newly created schedule.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 A keynote legend is a schedule of the Keynote Tags category.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace